// [NEXUS IDENTITY] ID: 3964834863050802996 | DATE: 2025-11-19


#Область ПрограммныйИнтерфейс

// Процедура - Код инициализации по типам
//
// Параметры:
//  КодИнициализации - Соответствие - тип данных и код для его установки 
//  * Ключ - Тип -Тип значения переменной
//  * Значение - Строка -Код установки значения
//
// Пример кода:
//  КодИнициализации.Вставить(Тип("СправочникСсылка.ПодразделенияОрганизаций"), "ТестовыеДанные.ПоздразделениеОрганизации(""%1"", Организация); // %1");
Процедура КодИнициализацииПоТипам(КодИнициализации) Экспорт
	
КонецПроцедуры

// Функция - Порядок сортировки переменных
// 
// Возвращаемое значение:
// Соответствие - типы значений и их порядок для сортировки
//  * Ключ - Тип -Тип значения переменной
//  * Значение - Число - Порядковый номер
//
// Пример кода:
//  Порядок.Вставить(Тип("СправочникСсылка.Организации"), 0);
Функция ПорядокСортировкиПеременных() Экспорт
	
	Порядок = Новый Соответствие;
	
	Возврат Порядок;
		
КонецФункции

// Функция - Постоянные данные
// 
// Возвращаемое значение:
// Соответствие - Данные которые являются постоянными для системы, и их можно искать по идентификатору указаном в значении
//  * Ключ - Тип -Тип значения переменной
//  * Значение - Строка - вариант поиска элемента справочника (Поддерживется: "Код", "Наиманование")
//
// Пример кода:
//  ПостоянныеДанные.Вставить(Тип("СправочникСсылка.Валюты"), "Код");
Функция ПостоянныеДанные() Экспорт
	
	ПостоянныеДанные = Новый Соответствие;

	Возврат ПостоянныеДанные;
		
КонецФункции

// Функция - Замена значений реквизитов по умолчанию
// 
// Возвращаемое значение:
//  Соответствие - Данные которые являются постоянными для системы, для них прописана строка фомирования
//  * Ключ - Строка - ИмяРеквизита
//  * Значение - Строка -  Код установки значения
//
// Пример кода:
//  ЗаменяемыеРеквизиты.Вставить("Дата", "ТекущаяДатаСеанса()");
Функция ЗаменаЗначенийРеквизитовПоУмолчанию() Экспорт
	
	ЗаменяемыеРеквизиты = Новый Соответствие;
	
	ЗаменяемыеРеквизиты.Вставить("Дата", "ТекущаяДатаСеанса()");
	ЗаменяемыеРеквизиты.Вставить("Номер", "ЮТест.Данные().СлучайнаяСтрока(20,,""0123456789"")");
	
	Возврат ЗаменяемыеРеквизиты;
		
КонецФункции

#КонецОбласти
